# Используем базовый образ PostgreSQL 12
FROM postgres:12

# Дополнительные инструкции, если необходимо

# Для примера, установим дополнительный пакет vim
RUN apt-get update && apt-get install -y vim

# Опционально, можно задать пользовательские переменные окружения
ENV POSTGRES_USER myuser
ENV POSTGRES_PASSWORD mypassword

# Опционально, можно скопировать SQL-скрипты и запустить их при инициализации базы данных
# COPY init.sql /docker-entrypoint-initdb.d/

# Опционально, можно указать порт, который будет открыт в контейнере
EXPOSE 5432

# Опционально, можно выполнить дополнительные команды или скрипты после запуска контейнера
# CMD [ "command" ]
